// - приведение к булю
// - ЗАПОМНИТЕ 6 ложных (false) значений приводящи false в логическом приобразовании.логическом
//      0; NaN; null; undefined; пустая строка; false

// - логическое И(оператор &&)
// - запинается на лжи
// - возвращает то, на чем запнулось или последний операнд

console.log(5 && 9 && 7 && 'mango');

// - логическое ИЛИ(оператор ||)
// - запинается на правде
// - Возвращает то, на чем запнулось или последний операнд

console.log(false || 7 || null || 9);

// - логическое НЕ(оператор!)
// - делает иверсию правда > ложь и ложь > правда

console.log(!undefined)